# N1 დავალება--------------------------------------------------
# a = float(input("შეიყვანეთ რიცხვი : "))
# b = float(input("შეიყვანეთ რიცხვი : "))

# print(a + b)
# print(a - b)
# print(a * b)
# print(a / b)
# print(a // b)
# print(a % b)
# print(a ** b)

# N2 დავალება--------------------------------------------------

# x = float(input("შეიყვანეთ დიაგონალი x : "))
# y = float(input("შეიყვანეთ დიაგონალი y : "))

# print(x * y / 2)

# N3 დავალება--------------------------------------------------

# m = float(input("შეიყვანეთ მეტრი : "))

# print(f"{m}მეტრი სანტიმეტრში არის :  {m * 100}")
# print(f"{m}მეტრი დეციმეტრში არის :  {m * 10}")
# print(f"{m}მეტრი მილიმეტრში არის :  {m * 1000}")
# print(f"{m}მეტრი მილში არის :  {m/1069}")

# N4 დავალება--------------------------------------------------

# h = float(input("სამკუთხედის სიმაღლე : "))
# f = float(input("სამკუთხედის ფუძე : "))

# print(f"სამკუთხედის ფართობია : {h * f / 2}")

# N5 დავალება--------------------------------------------------

# n = float(input("შეიყვანეთ ორნიშნა რიცხვი: "))

# if n >=10 and n <100:
#    print((n%10) + (n//10))
# else:
#    print("შეყვანილი რიცხვი არასწორია, გთხოვთ შეიყვანოთ ორნიშნა რიცხვი")












